#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/www.howtofixinternet.com/www.howtofixinternet.com/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/www.howtofixinternet.com/www.howtofixinternet.com

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/owenbendavies/howtofixinternet/runs/run-cRHooWSkLqPpM6tX[0m
[0m
Waiting for the plan to start...

Terraform v0.12.26
Configuring remote state backend...
Initializing Terraform configuration...
2020/06/06 17:17:04 [DEBUG] Using modified User-Agent: Terraform/0.12.26 TFC/a8f5477de7
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.cloudflare.cloudflare_page_rule.root_redirect[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_page_rule" "root_redirect" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m = 1
      [32m+[0m [0m[1m[0mstatus[0m[0m   = "active"
      [32m+[0m [0m[1m[0mtarget[0m[0m   = "howtofixinternet.com/*"
      [32m+[0m [0m[1m[0mzone_id[0m[0m  = (known after apply)

      [32m+[0m [0mactions {
          [32m+[0m [0m[1m[0malways_use_https[0m[0m    = false
          [32m+[0m [0m[1m[0mdisable_apps[0m[0m        = false
          [32m+[0m [0m[1m[0mdisable_performance[0m[0m = false
          [32m+[0m [0m[1m[0mdisable_railgun[0m[0m     = false
          [32m+[0m [0m[1m[0mdisable_security[0m[0m    = false

          [32m+[0m [0mforwarding_url {
              [32m+[0m [0m[1m[0mstatus_code[0m[0m = 301
              [32m+[0m [0m[1m[0murl[0m[0m         = "https://www.howtofixinternet.com/$1"
            }
        }
    }

[1m  # module.cloudflare.cloudflare_record.dmarc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_record" "dmarc" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "_dmarc"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = false
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "TXT"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "v=DMARC1; p=reject"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = (known after apply)
    }

[1m  # module.cloudflare.cloudflare_record.google_verification[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_record" "google_verification" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "howtofixinternet.com"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = false
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "TXT"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "google-site-verification=g66mj1SL8fAzl4iT8jVIjmYIzjuFzlUfrxSZ782sOSI"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = (known after apply)
    }

[1m  # module.cloudflare.cloudflare_record.site_root[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_record" "site_root" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "howtofixinternet.com"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = true
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "CNAME"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "howtofixinternet.com"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = (known after apply)
    }

[1m  # module.cloudflare.cloudflare_record.site_www[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_record" "site_www" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "www"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = true
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "CNAME"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "howtofixinternet.com"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = (known after apply)
    }

[1m  # module.cloudflare.cloudflare_record.spf[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_record" "spf" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "howtofixinternet.com"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = false
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "TXT"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "v=spf1 -all"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = (known after apply)
    }

[1m  # module.cloudflare.cloudflare_zone.main[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_zone" "main" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmeta[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname_servers[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mplan[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m                = "full"
      [32m+[0m [0m[1m[0mvanity_name_servers[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mverification_key[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                = "howtofixinternet.com"
    }

[1m  # module.cloudflare.cloudflare_zone_settings_override.main[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_zone_settings_override" "main" {
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0minitial_settings[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0minitial_settings_read_at[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mreadonly_settings[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mzone_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mzone_status[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone_type[0m[0m                = (known after apply)

      [32m+[0m [0msettings {
          [32m+[0m [0m[1m[0malways_online[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0malways_use_https[0m[0m            = "on"
          [32m+[0m [0m[1m[0mautomatic_https_rewrites[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mbrotli[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mbrowser_cache_ttl[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mbrowser_check[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mcache_level[0m[0m                 = "simplified"
          [32m+[0m [0m[1m[0mchallenge_ttl[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mcname_flattening[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mdevelopment_mode[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0memail_obfuscation[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mh2_prioritization[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mhotlink_protection[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mhttp2[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mhttp3[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mimage_resizing[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mip_geolocation[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mipv6[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mmax_upload[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mmin_tls_version[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mmirage[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mopportunistic_encryption[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mopportunistic_onion[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0morigin_error_page_pass_thru[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpolish[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mprefetch_preload[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivacy_pass[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mpseudo_ipv4[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mresponse_buffering[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mrocket_loader[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0msecurity_level[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mserver_side_exclude[0m[0m         = "off"
          [32m+[0m [0m[1m[0msort_query_string_for_cache[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mssl[0m[0m                         = "full"
          [32m+[0m [0m[1m[0mtls_1_2_only[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtls_1_3[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mtls_client_auth[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mtrue_client_ip_header[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0muniversal_ssl[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mwaf[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mwebp[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mwebsockets[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mzero_rtt[0m[0m                    = (known after apply)

          [32m+[0m [0mminify {
              [32m+[0m [0m[1m[0mcss[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mhtml[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mjs[0m[0m   = (known after apply)
            }

          [32m+[0m [0mmobile_redirect {
              [32m+[0m [0m[1m[0mmobile_subdomain[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mstatus[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mstrip_uri[0m[0m        = (known after apply)
            }

          [32m+[0m [0msecurity_header {
              [32m+[0m [0m[1m[0menabled[0m[0m            = true
              [32m+[0m [0m[1m[0minclude_subdomains[0m[0m = true
              [32m+[0m [0m[1m[0mmax_age[0m[0m            = 31536000
              [32m+[0m [0m[1m[0mnosniff[0m[0m            = true
              [32m+[0m [0m[1m[0mpreload[0m[0m            = true
            }
        }
    }

[1m  # module.datadog.datadog_synthetics_test.main[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "datadog_synthetics_test" "main" {
      [32m+[0m [0m[1m[0massertions[0m[0m = [
          [32m+[0m [0m{
              [32m+[0m [0m"operator" = "is"
              [32m+[0m [0m"target"   = "200"
              [32m+[0m [0m"type"     = "statusCode"
            },
          [32m+[0m [0m{
              [32m+[0m [0m"operator" = "is"
              [32m+[0m [0m"property" = "content-type"
              [32m+[0m [0m"target"   = "text/html; charset=utf-8"
              [32m+[0m [0m"type"     = "header"
            },
          [32m+[0m [0m{
              [32m+[0m [0m"operator" = "lessThan"
              [32m+[0m [0m"target"   = "6000"
              [32m+[0m [0m"type"     = "responseTime"
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocations[0m[0m  = [
          [32m+[0m [0m"aws:ca-central-1",
          [32m+[0m [0m"aws:eu-central-1",
          [32m+[0m [0m"aws:eu-west-1",
          [32m+[0m [0m"aws:eu-west-2",
          [32m+[0m [0m"aws:us-east-2",
          [32m+[0m [0m"aws:us-west-1",
          [32m+[0m [0m"aws:us-west-2",
        ]
      [32m+[0m [0m[1m[0mmessage[0m[0m    = "Notify @all"
      [32m+[0m [0m[1m[0mmonitor_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m       = "www.howtofixinternet.com"
      [32m+[0m [0m[1m[0moptions[0m[0m    = {
          [32m+[0m [0m"min_failure_duration" = "180"
          [32m+[0m [0m"min_location_failed"  = "2"
          [32m+[0m [0m"tick_every"           = "60"
        }
      [32m+[0m [0m[1m[0mrequest[0m[0m    = {
          [32m+[0m [0m"method"  = "GET"
          [32m+[0m [0m"timeout" = "30"
          [32m+[0m [0m"url"     = "https://www.howtofixinternet.com/"
        }
      [32m+[0m [0m[1m[0mstatus[0m[0m     = "live"
      [32m+[0m [0m[1m[0mtags[0m[0m       = [
          [32m+[0m [0m"terraform",
        ]
      [32m+[0m [0m[1m[0mtype[0m[0m       = "api"
    }

[0m[1mPlan:[0m 9 to add, 0 to change, 0 to destroy.[0m
```

</details>

*Pusher: @owenbendavies, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*